app/controllers/api/registrations_controller.rb

  def create
    respond_to do |format|
      format.json{
        if params[:api_key].blank? or params[:api_key] != API_KEY
          render :json => {'errors'=>{'api_key' => 'Invalid'}}.as_json, :status => 401
          return
        end

        require 'securerandom'
        newPassword = SecureRandom.hex(4)
        params[:user]["password"] = newPassword
        params[:user]["password_confirmation"] = newPassword

        build_resource

        resource = User.new(params[:user])

        debugger

        if resource.save
---
INSERT INTO `users` (`authentication_token`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `firstname`, `last_sign_in_at`, `last_sign_in_ip`, `lastname`, `nickname`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`) VALUES (NULL, '2013-09-17 13:45:26', NULL, NULL, 'test22@email.com', '$2a$10$IuWB7R9drC1qzmVZGX.s1.zNdm3VZWhGqoxocUpyx2sWuOIrTNx1W', NULL, NULL, NULL, NULL, 'testuser22', NULL, NULL, NULL, 0, '2013-09-17 13:45:26')