app/controllers/receipts_controller.rb

INSERT INTO `receipts` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `store_id`, `store_location_id`, `updated_at`, `user_id`) VALUES ('2013-09-19 15:30:00', 'image/png', 'facebook.png', 2938, '2013-09-19 15:29:59', NULL, NULL, '2013-09-19 15:30:00', 1)
---
  def upload_receipt_image
    unless params[:image].blank?
      @receipt = Receipt.new
      @receipt.user_id = params[:user_id]
      @receipt.store_id = params[:store_id]
      @receipt.store_location_id = params[:store_location_id]
      @receipt.image = params[:image]
      if @receipt.save